---
kind: type
id: T:Autodesk.Revit.DB.CylindricalSurface
source: html/95d452c1-6f7f-9d8e-a4fb-e2f1fe2818bc.htm
---
# Autodesk.Revit.DB.CylindricalSurface

A cylindrical surface.

## Syntax (C#)
```csharp
public class CylindricalSurface : Surface
```

## Remarks
The parametric equation of the cylinder is S(u, v) = center + radius*cos(u)*xVec + radius*sin(u)*yVec + v*zVec.